Revit 2027 API
PropertyLine.Area Property
 The area of the PropertyLine element, if it is close loop, the value would be greater than 0, otherwise it will return -1.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Area { get; }
Public ReadOnly Property Area As Double
	Get
public:
property double Area {
	double get ();
}
member Area : float with get
Property Value
Double
See Also
Reference
PropertyLine Class
Autodesk.Revit.DB Namespace